{
  "header": {
    "brand": "JCoding",
    "resumeLabel": "Resume",
    "nav": [
      { "id": "home", "label": "Home" },
      { "id": "about", "label": "About" },
      { "id": "stack", "label": "Stack" },
      { "id": "projects", "label": "Projects" },
      { "id": "contact", "label": "Contact" }
    ]
  },
  "about": {
    "sectionTitle": "About Me",
    "headline": "Beyond the Code",
    "experienceTitle": "Relevant Experience",
    "experience": [
      {
        "title": "Global Game Jam 2025",
        "category": "Hackathon",
        "description": "Participation in a global game jam, contributing visual assets and supporting the early-stage prototype under time constraints.",
        "fullDescription": [
          "Collaborated in a short-term, high-pressure environment to explore a game concept based on the event theme.",
          "My contribution focused on creating and integrating a small set of visual assets to support the prototype."
        ],
        "certificateUrl": "/certificates/globalGameJam.pdf"
      },
      {
        "title": "HackaEdu 2025",
        "category": "Hackathon",
        "description": "Concept design of an educational platform using AI to enhance reading comprehension through guided content.",
        "fullDescription": [
          "Led the conceptual design of a learning platform aimed at improving reading comprehension through structured content and feedback.",
          "The work focused on ideation, flow definition, and mockups, while the technical implementation was not completed during the event."
        ],
        "certificateUrl": "/certificates/hackaEdu.pdf"
      },
      {
        "title": "HackaOdísea 2026",
        "category": "Hackathon",
        "description": "Development of a backend chat module for a child-focused risk detection solution aligned with the SDGs.",
        "fullDescription": [
          "Worked on the backend of a chat-based system designed to identify potential risk scenarios for children.",
          "I was responsible for one of the backend services, including the chat module logic and backend deployment.",
          "The system was composed of two backend services: one handling application logic and another managing direct communication with the language model, developed by a teammate."
        ],
        "certificateUrl": "/certificates/hackaOdisea.pdf"
      }
    ],
    "paragraphs": [
      "I’m Julio, a fourth-year Systems Engineering student at UNSA, interested in web development and backend fundamentals.",
      "I enjoy understanding how applications are structured at a project level, organizing code clearly, and learning how data flows between the frontend and backend.",
      "I’m currently looking for opportunities to gain professional experience, contribute to real projects, and continue learning through hands-on development."
    ],

    "coreTitle": "Core Philosophy",
    "core": [
      
      {
        "icon": "lightbulb",
        "title": "Problem Solving",
        "description": "Finding elegant solutions to complex logic hurdles."
      },
      {
        "icon": "groups",
        "title": "Teamwork",
        "description": "Collaboration as the foundation for great products."
      },
      {
        "icon": "psychology",
        "title": "Learning",
        "description": "Constant evolution in a fast-paced ecosystem."
      }
    ],
    "hobbies": [
      { "icon": "mdi:coffee", "label": "Coffee Enthusiast" },
      { "icon": "mdi:palette", "label": "Painting" },
      { "icon": "mdi:chess-king", "label": "Chess" },
      { "icon": "mdi:book-open-variant", "label": "Casual Reading" }
    ]
  }
}
